<template>
  <div class="nav-section active">
    <div style="margin: 15px"></div>
    <nav>
      <h3><i class="fa-solid fa-circle-info"></i> v0.2.1 <mark>最新</mark></h3>
    </nav>
    <div class="navlist">
      <div class="card">
        <h4><i class="fa-solid fa-rotate"></i> 更新时间：2026.06.25</h4>
        <p>
          <b>基于0.2.0版本的一次简单修订</b>
          <br>更新内容如下：
          <br>1. 修复了一些不知道怎么出现的问题，小胡买了Trae Work的会员，因此帮我扫描并修复了一些问题。
          <br>2. 终于把侧边栏的几个部分都补齐了，包括“了解成中医”和“重要信息”两个导航项。
          <br>3. 上个版本里面“成中医导航”是比较空的，现在补上了各学院的链接。
          <br>4. 因为在自己服务器上部署会出现各种各样的问题，小胡把这个项目开源了，然后使用CloudFlare Pages部署，有可能加载有点慢，见谅。
        </p>
      </div>
    </div>
    <nav>
      <h3><i class="fa-solid fa-circle-info"></i> v0.2.0</h3>
    </nav>
    <div class="navlist">
      <div class="card">
        <h4><i class="fa-solid fa-rotate"></i> 实际更新时间：2026.06.24，代码完成时间：2026.05.31</h4>
        <p>
          <b>一次大更新，虽然从界面上看不太明显</b>
          <br>更新内容如下：
          <br>1. 使用Vue3重写了整个系统。
          <br>2. 重新调整了导航内容的分类，使其更加有条理有逻辑。
          <br>3. 导航标题更换为学校LOGO+“工具导航”，校徽是超清的，如需做PPT或者视频可以长按保存。
          <br>4. 新增了成中医电话导航。
          <br>5. 新增“了解成中医”页面。
        </p>
      </div>
    </div>
    <nav>
      <h3><i class="fa-solid fa-circle-info"></i> v0.1.4</h3>
    </nav>
    <div class="bicol navlist">
      <div class="card">
        <h4><i class="fa-solid fa-rotate"></i> 更新时间：2026.05.17</h4>
        <p>
          又是一次热更新。
          <br>更新内容如下：
          <br>修复了菜鸟驿站取快递功能。
          <br>新增了外研社英语学习平台WeLearn（好久没上英语课已经快忘了用的是什么软件了）。
          <br>感谢各位在抖音上的支持！有任何建议欢迎加顶部的QQ群提出。
          <br>然后，如各位所见，导航栏上还有两个按钮是暂时啥都没放的。除了导航，各位还有没有啥好的想法，集思广益一下嘛。
        </p>
      </div>
      <div class="card">
        <h4>然后除此之外回复一下大家问得多的问题</h4>
        <p>
          1. 好厉害，怎么想到做这个网站的？
          <br>其实也是突发奇想，觉得我们学校公众号服务号太分散了，畅行杏林藏得有点深。网站最初的版本不是我写的，是西邮的学长纸鹿写的，我拿到手以后补了个导航栏，希望可以再扩充一些大家想用到的功能。
          <br>2. 明明应该是学校做的事情，为什么你来做了？
          <br>我其实觉得我们学校的信息中心做得已经算不错了，至少在保障上课情况和日常教学秩序上没出过差错。但是信息中心的老师们毕竟不是学生，可能很难去完整体验学生在日常生活中能用到的功能到底有哪些，而学生很多时候即便是想提出建议却无从下手。
        </p>
      </div>
    </div>
    <nav>
      <h3><i class="fa-solid fa-circle-info"></i> v0.1.3</h3>
    </nav>
    <div class="card">
      <h4><i class="fa-solid fa-rotate"></i> 更新时间：2026.05.16</h4>
      <p>
        又是一次热更新。
        <br>更新内容如下：
        <br>新增了成中医实验室管理系统。
        <br>新增了微就业、微学工两个系统。
        <br>感谢各位在抖音上的支持！有任何建议欢迎加顶部的QQ群提出。
      </p>
    </div>
    <nav>
      <h3><i class="fa-solid fa-circle-info"></i> v0.1.2</h3>
    </nav>
    <div class="card">
      <h4><i class="fa-solid fa-rotate"></i> 更新时间：2026.05.15</h4>
      <p>
        一次热更新。
        <br>更新内容如下：
        <br>新增了华迪杯计算机设计大赛四川省省赛的地址。
        <br>发现了掌上金课即便是从微信打开也会有弹窗提醒未登录，所以现在提取了登录链接，但还是需要手机号登录。
        <br>然后我在我们学校的两个校园频道上都发了关于这个网站的信息，其中一个竟然把我帖子删了，还给我禁言了一个月。气煞我也，我决定把这个校园墙的链接删了来泄愤！
        <br>所以现在要是有人点到了第一个的话应该是会报错的。
      </p>
    </div>
    <nav>
      <h3><i class="fa-solid fa-circle-info"></i> v0.1.1</h3>
    </nav>
    <div class="card">
      <h4><i class="fa-solid fa-rotate"></i> 更新时间：2026.05.14</h4>
      <p>
        一次热更新。补充了一些有用的链接。
        <br>更新内容如下：
        <br>新增了WiFi认证、智慧后勤、保卫处、访客进校登记、校医院等功能。
        <br>如果进入网站以后提示“浏览器版本过低”，多半是因为浏览器缓存导致的，刷新一下就好了。
      </p>
    </div>
    <nav>
      <h3><i class="fa-solid fa-circle-info"></i> v0.1.0</h3>
    </nav>
    <div class="bicol navlist">
      <div class="card">
        <h4><i class="fa-solid fa-rotate"></i> 更新时间：2026.05.10</h4>
        <p>
          感谢大家的捧场，这三天网站的浏览量已经过万了，真的受宠若惊！
          <br>这个绝对算得上一次大更新，所以给了个新版本号，更新内容如下：
          <br>
          1. 新增了更新日志页面，加入导航栏，功能更加齐全完善（虽然没写完）。
          <br>
          2. 优化了响应式布局的相关内容，解决了之前问到的"手机上显示比较小"的问题。
          <br>
          3. 修复了一些bug，提高了稳定性。
          <br>
          4. 设置了一个QQ群反馈通道，群号在网站最上面，欢迎反馈问题和建议。
        </p>
      </div>
      <div class="card">
        <h4>未解决问题以及部分Q&A</h4>
        <p>
          <b>1. 什么时候可以做一个苹果的快捷指令版？</b>
          <br>一是因为我没有苹果设备，测试起来很麻烦；二是有些功能（如微教务、E聚落、校园卡）只有微信打开才能用。
          <br>还有就是这个网站目前只有我一个人维护，维护成本有一点点高，所以暂时没有计划做一个苹果的快捷指令版。
          <br>
        </p>
        <p>
          <b>2. 考虑通过这个网站盈利吗？</b>
          <br>说实话有想过，大学生手上都挺捉襟见肘的。但是肯定不会为了赚钱把这个网站变难用！
        </p>
      </div>
    </div>
    <div style="margin: 15px"></div>
    <nav>
      <h3><i class="fa-solid fa-circle-info"></i> v0.0.2</h3>
    </nav>
    <div class="card">
      <h4>更新时间：2026.05.08</h4>
      <p>
        一次热更新。修复了微教务系统没有办法在微信打开的问题。感谢"𝓑𝓪𝓮𝓴𝓱𝓾𝔂𝓷."的反馈。
        <br>
        <del>然后发现微教务系统弱不禁风，甚至没有证书。</del>
      </p>
    </div>
    <div style="margin: 15px"></div>
    <nav>
      <h3><i class="fa-solid fa-circle-info"></i> v0.0.1</h3>
    </nav>
    <div class="card">
      <h4>更新时间：2026.05.07</h4>
      <p>也就是网站的最初版本，没有什么可以说的，大家也都用过。</p>
    </div>
  </div>
</template>
